{"Dataset":"magellan","KeyName":"Inbound Sample 2","Service":"Google","Duration":229,"Transcript":"You're listening to my zone Solutions, podcast for more information about my job Solutions log on to www.jones-wynn.com. Thanks for calling AT&T, when he was Erica, can I have the wireless cell phone number to their calling about today? Well, six, five through nine. One, two, zero two, six, five, three nine, one, two zero two is that correct? Yeah. The Warriors for me first. And last name of the account holder. Four digits of your Social Security number. 553. Information. Data, stand correctly. Use the very letter regarding the Blair torch and you want to take advantage of this offer. Yes. Okay, the more than happy to see that I've been feeling out all the information needed for the exchange. And this will be processed within 24 hours from now. And it's just one that, you know, that the new device will arrive within three to five business days. Please do not return old phone until you receive the new device, and I just want to let you know that if there is no phones, not returned within 30 days, you will be subject to 150 dollar charge, build your account. Also, please don't forget to take the SIM card out of the original phone and place it in the new phone, okay? And also, you will be receiving a customer service for me that outside to service by 83 features by email or use male, the summary will include an activation key. However, this is not apply to you and you will not be charged. We do apologize for any confusion. This may cost. If you have any further questions regarding this, please feel free to ask 611 from 180, okay? Sending a return label as well for you to return the old device and just going to verify where they want me to send the return label. You want me to send it via email or to your shipping address. Shipping, okay, so I'm just going to verify that will be the 98 Milestone Dr. Belgrade Montana, 59714, that correct. yes, okay, and if this is the same address from going to ship, the BlackBerry Torch Yes. Okay. And also, once you receive the block, I mean the return label just simply have fixed it to the phone box and drop it in any USB blue box. So okay, USPS blue box. Okay. Okay, so I'm done feeling that all the information needed here for the exchange. So do you have any questions regarding the information that I provide? You Mr. Milligan. Know, is there anything else I can help you with? Okay, appreciate your business. Thank you for calling AT&T. Have a great day. Thank you, goodbye. Thank you for listening to our podcast. Find out more about our services by visiting."}