{"Dataset":"magellan","KeyName":"Inbound Sample 1","Service":"Google","Duration":567,"Transcript":"You have reached the essence of argon. This is Donna. I'll be assisting you with your inquiries today. Please be informed, that this call is being recorded and monitored for quality assurance purposes. How may I help you? Well, I bought a right. I got this essence of Oregon oil. For shipping handling, and handling costs to find 99 sample of it. And if I want to cancel the order, I had to do it within 15 days. And so that is what I want to do. I didn't want to, I didn't want to get, you know, like a monthly for what is it 83.00% your last name. I'm Carolyn she a r o l y n lake lake. And then, yes. L a k e. Yes. Okay, I just go ahead to pull up here, subscription here or your account. Okay. And could you gonna break fire even letters? Please It's a lake 3921 at hotmail.com. How about your shipping address? 310 Warren Avenue. Number two, Gillette Wyoming 82716. And is there, it mean shipping address same as our building address. Correct. How about your phone number? 307-680-2068. Okay, thank you very much for that information is Lake. If you don't mind me asking me another reason why you want to cancel the subscription. Well, I just I thought I was just getting a sample order of it, you know. I was curious. Have you know how it worked and everything? Yes. I mean, have you already, you know, not all of it. It's not all of it but I have. Okay, I have been using that. Yes, okay, I don't understand that mistake. This is what I can do for you, for you, to be able to, you know, to maximize or enjoy the benefits of the Argon. I'm going to extend your pretrial for another 15 days with no charts. So at least you do have 15 days to enjoy, you know, the amazing product and then give us a call back before the end of that 15-day additional extension period to give us the feedback because what I heard from you, that you haven't used a product that much so you're not, you know, he did not yet, get what the benefits of it. So that's the reason why I'm extending your period or your free trial for you to be able to enjoy and discover the benefits of essence of Oregon, okay? Okay. Let me check here. So, you're already extended, you're a pretty tired. It will add on August 24th, so you need to give us a call back before August 24th to give us a feedback. if you I mean what happened to the product if it did something, you know, it gives you the benefits that you need but Let's say you love the product, you like the product, you don't need to give us a call back then, okay? It will be automatically you will be receiving another bottle for your monthly subscription and in one set of a call. I heard that you're not, you know, you're you're dealing about the the price which is 83 dollars and 83, right? Okay. So what I can do for you is aside from extending your pre-trial for another 15 days and also giving you my employee discount, which is 20% discount. So instead the paying 883.87 you're going to pay only 67 dollars and four cents. How about that? I can't, I can't afford that. Okay, this is not. This is my maximum employee discount, 40% employee discount. I'll give it to you. It's actually a lifetime employee discount so instead of paying 83 dollars and 87 so just paying 50 dollars and 28 cents. No, I can't. I can't. I cannot do that. Okay, I'd like to. And and I wanted to ask you too is go ahead. Um, how often am I supposed to use that? Like, at night or yes, as long as you want. Now, just use it at night. Yes, as long as you want, as long as you need it, oh, Okay. Okay is like can I just yeah I can of course. How can I just put it? Sure, thank you. Thank you very much for your patient. Debating Ms. Lee. Mm-hmm. Okay. I already talked to my supervisor and she asked me what amount would you feel? The product will be more affordable for you and make your continuing your subscription with us. Oh, well, if we will ask you, do you I you know like 15 dollars. Oh that's you know but that's okay man. No way that's great because already giving you my employee discount of 40%, right? So my supervisor can give you another 40% so that's an equivalent of 80%. So instead of paying 82 dollars and eighty cents, what you'll be paying is only 16 dollars and 176 cents every month for everybody. How about that? That sounds great. Okay, that's great. So I'm extending your pre-trial until August 24th. So after August 24th, you will be charged only. 16 dollars and 76 cents, okay? So every month you will be paying, I mean you will be receiving a bottle business of our God and you will be enjoying the benefits of the product, but you will be only paying 16 dollar and seventy six cents, okay? Okay, that's so that's great. So um just for a recap mistake. I extended your pretrial for another 15 days and it's going to be added on August 24th so you can give us a call back by within that period of time to give us a feedback. But if like what I've said, if you enjoyed the product, it gives you the benefits. The amazing benefits of the product. You don't need to give us a call back. It will be automatically, you will be receiving a subscription every month. But you will be only paying 16 dollars, 76 cents because you already give you our employee discount of 80% for Lifetime, okay? Okay. All right. Okay so well is there anything else I can help you with? No, that would be okay. That's so we value your business. Thank you for calling essence of our God. Have a great day. You too, bye."}