{"Dataset":"magellan","KeyName":"Inbound Sample 2","Service":"AWS","Duration":229,"Transcript":"You're listening to Medjell Solutions podcast. For more information about Magell Solutions, log on to www.mjones-solutions.com. And now here's an inbound call recording. Thanks for calling AT&T. My name is Erica. Can I have the wireless cellphone number that they're calling about today? 406-539-1202. To confirm that number was 406-539-1202. Is that correct? Yes. So how may I help you today? Oh, I got this letter saying I can get the Blackberry torch. Mhm. OK, that I'd be more than happy to assist you with that. But before I proceed, for security reasons of your account, can you please verify some information for me first? Yeah. Can I have the first and last name of the account holder? Josh Megan. OK. And who am I speaking with today, if I may ask? OK, Mr. Milligan, can you please verify the billing zip code? 59714 And also the last four digits of your social security number. 5528. Thanks so much for that information. So just to make it clear today I understand you correctly you received a letter regarding the block bear torch and do you want to take advantage of this offer? Yes. OK, I'll be more than happy to assist you with that. I'll be filling out all the information needed for the exchange, and this will be processed within 24 hours from now, and I just want to let you know that the new device will arrive within 3 to 5 business days. Please do not return old phones until you receive the new device, and I just want to let you know that if the original phone is not returned within 30 days, you will be subject to a $150 charge billed to your account. Also, please don't forget to take the SIM card out of the original phone and place it in the new phone, OK? And also you will be receiving a customer service summary that at times your ATD service by ATD features by email or US mail. This summary will include an activation fee. However, this does not apply to you and you will not be charged. We do apologize for any confusion this may cause, and if you have any further questions regarding this, please feel free to dial 611 from AT&T has it, OK. Sure. And I'll be sending a return label as well for you to return the old guys. I'm just going to verify where they want me to send the return label. Do you want me to send it by email or to your shipping address? Shipping. OK, so I'm just going to verify that it would be the 98 Marton Drive, Belvide, Montana. 59714, is that correct? Yes. OK, and is this the same address where I'm going to ship the Blackberry torch? Yes. OK, and also once you receive the, uh, I mean the return label, just simply a fix it to the phone box and drop it in any USB blue box, OK? Drop it in what? In any USPS blue box. OK. OK, so I'm done filling out all the information needed here for the exchange. So, do you have any questions regarding the information that I provided you, Mr. Milligan? No. Is there anything else I can help you with? I don't think so. OK, we do value and appreciate your business. Thank you for calling AT&T and have a great day. Thank you. OK, goodbye. Bye. Thank you for listening to our podcast. Find out more about our services by visiting www.magellan-solutions.com or call our toll-free numbers from US, UK, and Australia."}