{"Dataset":"magellan","KeyName":"Inbound Sample 1","Service":"AWS","Duration":567,"Transcript":"You have reached the essence of Oregon. This is Donna. I'll be assisting you with your inquiries today. Please be informed that this call is being recorded and monitored for quality assurance purposes. How may I help you? Um, well, I bought, I, I got this, um, essence of Argon oil, um, for shipping handling and handling cost of 599, a sample of it, and, um, if I want to cancel the order I had to do it within. Uh, 15 days and so that is um what I wanted to do. I didn't want to, I didn't want to get, you know, like a monthly. For what is it? $83 a month um I can't afford that. OK, I'm more than happy I mean I'm I'm happy to assist you um for me to be able to pull up your um subscription here, could you kind of provide me your first and your last name? Um, Carolyn, C A R O L Y N, Lake, L A K E. O. And then L A K E. Yes. OK, I just go ahead to pull up your uh subscription here or your account. OK. And uh could you gonna verify your email address please? It's uh Lake 3921@hotmail.com. How about your shipping address? 310 Warren Avenue, number 2, Gillette, Wyoming 82716. And is your, I mean shipping address the same as your billing address? Correct. How about your phone number? Um, 307-680-2068. OK, thank you very much for that information, Miss Lake. If you don't mind me asking, may I know the reason why you want to cancel the subscription? Well, I just, um, I thought I was just getting a, a, a sample order of it, you know, I was curious, um. Have you how it works and everything. Yes, I mean, have you already not all of it but. Not all of it but I have. I have been using it, yes. OK, I do understand that uh Ms. Lake, uh, this is what I can do for you for you to be able you know to uh maximize or enjoy the benefits of the organ. I'm going to extend your uh pre-trial for another 15 days with no charge so at least you do have uh 15 days to enjoy, uh, you know. The amazing product and then uh give us a call back uh before the end of that 15 day additional or extension period to give us the feedback because what I heard from you is that you haven't used the product uh that much so you're not, you know, here did not yet get what the benefits of it so that's the reason why I'm extending your um. Uh, period or your pretrial for you to be able to uh enjoy and discover the benefits of essence of organ, OK. OK, um, what date would that be? OK, let me check here. So you're um uh already extended your uh free trial it will end on August 24th, so you need to give us a call back before August 24th to give us a feedback, uh, if you, uh, I mean what happened to the product if it didn't something, you know. Uh, it gives you the benefits that you need, but let's say, uh, you love the product, you like the product, you don't need to give us a call back then, OK? It will be automatically, uh, you will be receiving, uh, another bottle for your monthly subscription and, uh, in onset of a call I heard that you're not, you know, um, you're uh you're dealing about the. The price which is $83.80 cents, right? OK, so what I can do for you is aside from extending your pre-trial for another 15 days, I'm also giving you my employee discount which is 20% uh discount. So instead of paying $83.80 you're going to pay only $67.04. How about that? I, I can't, I can't afford that. OK, uh, this is my, uh huh, uh, this is my maximum employee discount, a 40% employee discount. I'll give it to you it's actually a lifetime employee discount, so instead of paying $83.80 or just be paying $50.28. No, I can't I can't I cannot do that. I can't. I'd like to and, and. I wanted to ask you too is. Um, how often am I supposed to use that like at night or as long as you want, just use it at night. Yes, as long as you want, as long as you need it. Oh, OK. OK, um, Ms. Lake, can I just put you? Yeah, I can't afford. uh, can I just put you on hold for a minute? Sure, thank you. Thank you very much for your patiently waiting, Ms. Lake. Mhm. OK, I already talked to uh my supervisor and um she asked me, uh what amount would you feel the product will be more affordable for you and make you continue your subscription with us. Oh, If if we will ask you, do you think I could, I could, you know, like $15. I know that's, you know, but that. OK, ma'am, don't worry, that's great. Uh, because I already giving you my employee discount of 40%, right? So my supervisor can give you another 40%, so that's an equivalent of 80%. So instead of paying $83.80 what you'll be paying is only $16.76 every month for everybody. How about that? That sounds great. OK, that's great. So, uh, I'm extending your uh pre-trial until August 24th, so after August 24th you will be charged only. $16.76. OK, so every month you will be paying, I mean you will be receiving a bottle of essence of Ion and you will be, uh, enjoying the benefits of the product, but you will be only paying $16.76 OK? OK. OK, that's so that's great so um. Uh, just for a recap, Ms. Lake, I extended your pretrial for another 15 days, and it's going to end on August 24th, so you can give us a call back, uh, by within that period of time to give us a feedback. But if like what I said, if you enjoy the product, it gives you the benefits the amazing benefits of the product. You don't need to give us a call back. It will be automatically you will be receiving a subscription every month, but you will be only paying. Uh, $16.76 because we already give you our employee discount of 80% for lifetime, OK? OK, all right, OK then, so, um, is there anything else I can help you with? Um, no, that would be it. OK then, so we value your business. Thank you for calling Essence of Oregon have a great day. You too bye bye."}