{"Dataset":"magellan","KeyName":"Inbound Sample 1","Service":"Deepgram","Duration":567,"Transcript":"You have reached the essence of Hargon. This is Donna. I'll be assisting you with your inquiries today. Please be informed that this call is being recorded and monitored for quality assurance purposes. How may I help you? Well, I bought or I I got this essence of Oregon oil Mhmm. For shipping handling, and handling cost of five nine nine. Uh-huh. A sample of it. Mhmm. And if I want to cancel the order, I had to do it within fifteen days. Uh-huh. And so that is what I want wanted to do. I didn't want to I didn't want to get, you know, like, a monthly for what is it? Eighty three dollars a month. Okay. I can't afford that. Okay. I'm more than happy I mean, I'm happy to assist you. For me to be able to pull up your subscription here, could you kindly provide me your first and your last name? Caroline, c a r o l y n, Lake, l a k e. O l y n. And then Lake? Yes. L a k e? Yes. Okay. Let's just go ahead to pull up your subscription here or your account. Okay. And could you kindly verify your email address, please? It's Lake three nine two one at Hotmail dot com. How about your shipping address? Three ten Warren Avenue, number two, Gillette, Wyoming eight two seven one six. And is your shipping address same as your billing address? Correct. How about your phone number? Three zero seven six eight zero two zero six eight. Okay. Thank you very much for that information, miss Lake. If you don't mind me asking, may I know the reason why you want to cancel the subscription? Well, I just I thought I was just getting a a a sample order of it. Mhmm. You know, I was curious if Have you already used it? Worked and everything. Yes. I mean Uh-huh. Have you already used it? Not all of it, but not all of it, but I have. Okay. I have been using it. Yes. Okay. I do understand that, miss Blake. This is what I can do for you for you to be able, you know, to, maximize or enjoy the benefits of the Oregon. I'm going to extend your pretrial for another fifteen days with no charge. So at least you do have fifteen days to enjoy, you know, the amazing product. And then give us a callback before the end of that fifteen day additional or extension period to give us the feedback. Because what I heard from you is that you haven't used the product that much. So you're not you know, here did not yet get what the benefits of it. So that's the reason why I'm extending your Okay. Period or your pretrial for you to be able to enjoy and discover the benefits of Essence of Oregon. Okay? Okay. What date would that be? Okay. Let me check here. So you're already extended your pretrial. It will end on August twenty fourth. You need to give us a callback before August twenty fourth to give us a feedback. If you I mean, what happened to the product, if it did something you know, it gives you the benefits that you need. But let's say you love the product, you like the product, you don't need to give us a callback then. Okay? It will be automatically Okay. You will be receiving another bottle for your monthly subscription. And in onset of a call, I heard that you're not you know, you're you're dealing about the the price, which is eighty three dollars and eighty cents. Right? Okay. So what I can do for you is aside from extending your pretrial for another fifteen days, I'm also giving you my employee discount, which is twenty percent discount. So instead of paying eighty three dollars and eighty cents, you're going to pay only sixty seven dollars and four cents. How about that? I I can't. I can't afford that. Okay. This is my uh-huh. This is my maximum employee discount. A forty percent No. I can't. I can't. I cannot do that. I can't. I'd like to and and Can I to ask you too is Go ahead? How often am I supposed to use that? Like, at night? Or Yes. As long as you want, ma'am. Just just use it at night? Yes. As long as you want. As long as you need it. Oh, okay. Okay, miss Lake. Can I just put you on hold for minute? Can't afford. Can I just put you on hold for a minute? Okay. Sure. Thank you. Thank you very much for your patiently waiting, miss Lake. Mhmm. Okay. I already talked to my supervisor, and she asked me what amount would you feel the product would be more affordable for you and make your continue your subscription with us? Oh. We will if we will ask you, do you think I I could Mhmm. I could you know, like, fifteen dollars. Oh, that's that's, you know, but that Okay, ma'am. Don't worry. That's great. Because I already given you my employee discount of forty percent. Right? So my supervisor can give you another forty percent. So that's an equivalent of eighty percent. So instead of paying eighty two dollars and eighty cents, what you'll be paying is only sixteen dollars and seventy six cents every month for everybody. How about that? That sounds great. Okay. That's great. So I'm extending your pretrial until August twenty fourth. So after August twenty fourth, you will be charged only sixteen dollars and seventy six cents. Okay? So every month Okay. You will be paying I mean, you will be receiving a bottle of essence of argon, and you will be enjoying the benefits of the product, but you will be only paying sixteen dollar and seventy six cents. Okay? Okay. Okay then. So that's great. So just for a recap, miss Lake, I extended your pretrial for another fifteen days, and it's going to be end on August twenty fourth. So you can give us a callback by within that period of time to give us a feedback. But if like what I've said, if you enjoy the product, it gives you the benefits, the amazing benefits of the product, you don't need to give us a callback. It will be automatically you will be receiving a subscription every month, but you will be only paying sixteen dollar and seventy six cents because we already give you our employee discount of eighty percent for lifetime. Okay? Okay. Alright. Okay then. So is there anything else I can help you with? No. That would be it. Okay then. So we value your business. Thank you for calling Essence of Oregon. Have a great day. You too. Bye. Bye bye."}