{"Dataset":"magellan","KeyName":"Inbound Sample 2","Service":"Deepgram","Duration":229,"Transcript":"You're listening to Magellan Solutions Podcast. For more information about Magellan Solutions, log on to w w w dot Magellan dash Solutions dot com. And now here's an inbound call recording. Thanks for calling AT and T. My name is Erica. Can I have the wireless telephone number that they're calling about today? Four zero six five three nine one two zero two. To confirm, that number was four zero six five three nine one two zero two. Is that correct? Yes. So how may I help you today? Well, I got this letter saying I can get the BlackBerry Torch. Mhmm. K. Don't worry. I'd be more than happy to assist you with that. But before I proceed, for security reasons of your account, can you please verify some informations for me first? Yep. Can I have the first and last name of the account holder? Josh Milligan. Okay. And who am I speaking with today, if I may ask? Josh. Okay. Mister Milgan, can you please verify the billing ZIP code? Five nine seven one four. And also the last four digits of your Social Security number? Five five two eight. Thank you so much for that information. So just to make it clear that I understand you correctly, you received a letter regarding the block bear torch. And Yes. Do you want to take advantage of this offer? Yes. Okay. I'd be more than happy to assist you with that. I'll be filling out all the information needed for the exchange, and it will be processed within twenty four hours from now. And I just want to let you know that the new device will arrive within three to five business days. Please do not return old phone until you receive the new device. And I just want to let you know that if the original phone is not returned within thirty days, you will be subject to a hundred fifty dollar charge bill to your account. Also, please don't forget to take the SIM card out of the original phone and place it in the new phone. Okay? Sure. And also, you will be receiving a customer service summary that outlines your AT and service by AT and T features by email or US mail. This summary will include an activation fee. However, this does not apply to you and you will not be charged. We do apologize for any confusion this may cause and if you have any further questions regarding this, please feel free to dial six eleven from AT and T handset, okay? Sure. And I'll be sending a return label as well for you to return the old device. I'm just going to verify where they want me to send the return label. Do you want me to send it via email or to your shipping address? Shipping. Okay. Let me so I'm just going to verify that it would be the ninety eight Milestone Drive, Belviaton, Montana five nine seven one four. Is that correct? Yes. Okay. And is this the same address where I'm going to ship the black power torch? Yes. Okay. And also once you receive the black I mean, return label, just simply have fixed it to the phone box and drop it in any USPS blue box. Okay? Drop it in what? In any USPS blue box. Okay. Okay. So I'm done filling out all the information needed here for the exchange. Sir, do you have any questions regarding the information that I provided you, mister Milligan? No. There anything else I can help you with? I don't think so. Okay. We do value and appreciate your business. Thank you for calling AT and T, and have a great day. Thank you. Okay. Goodbye. Bye. Thank you for listening to our podcast. Find out more about our services by visiting www.magellan dash solutions dot com or call our toll free numbers from US, UK, and Australia."}