{"Dataset":"rev","KeyName":"Boeings Big Bet","Service":"Deepgram","Duration":157,"Transcript":"Boeing is known for airplanes, but they actually have a long history in space. Since NASA's beginning, Boeing has been a contractor on every manned space program, including building the parts for the International Space Station. Boeing has been in human spaceflight from day one, and so it's just part of our core. NASA is hosting a competition for private enterprise to build a spacecraft to transport humans to the International Space Station. Winning this contract would cement dominance in the new space race. We see this as just the next huge opportunity for Boeing and for NASA. How big do you expect the market to be? The development price itself is is such a huge barrier. Just a very different business model than Boeing's used to. Our huge development programs are typically centered around commercial airplanes and military aircraft where there is a lot of orders. And right now, the foundation of the business is two flights a year. And Boeing hopes that those flights will be made in their CST one hundred capsule. Their weldless design makes their craft stronger and lighter than traditional models. I'm ready to get inside the space capsule. Alright. We'll come on in. Okay. How many astronauts will fly in this capsule? Right now, we've configured it to fly up to five, but the CST one hundred is designed for up to seven. We have a significant experience, obviously, in capsules from Mercury and Gemini Apollo. The capsule was was an easy decision. What about comfort? This isn't exactly the most comfortable position I've ever been in. No. Absolutely. But because of the potential with different anomalies, you could have a very rough landing. We needed to make sure that this design would, would satisfy even the roughest potential landing. Chris Ferguson piloted America's last shuttle, and his new mission is to get Boeing's commercial space program off the ground. This is the simulator for the CST one hundred? Yes. This is gonna be what we call our engineering simulator. How similar is commanding a spaceship to piloting an airplane? Well, if you sit here and you look at this cockpit, you'd say, wow. It looks like I'm in a fighter airplane. Boeing has been building fighter airplanes for decades. So we were able to take a lot of the expertise and involve a lot of the people who designed these cockpits and make them a part of this right here. Do you think that that lineage in history gives Boeing a leg up over their competitors? I would like to think so. Of course, Boeing was the prime contractor to build the space shuttle."}