{"Dataset":"rev","KeyName":"Boeings Big Bet","Service":"Google","Duration":157,"Transcript":"Boeing is known for airplanes but they actually have a long history in space since NASA's beginning. Boeing has been a Contractor on every manned space program including building the parts for the International Space Station. Boeing has been in human spaceflight from day one. And so it's just part of our core. NASA is hosting a competition for private Enterprise to build a spacecraft to transport, humans to the International. Space Station winning this contract with dominance in the new space race. we see this as just, the next huge opportunity for Boeing and for NASA, how Do you expect? The development price itself is such a barrier, just a very different business model than Boeing used to our huge development programs are typically centered around commercial, airplanes and military aircraft where there is a lot of orders. And right now, the foundation of the business is two flights a year and Boeing hopes that those flights will be made. In their cst-100 capsule. Their weld list design. Makes their craft stronger and lighter than traditional models. I'm ready to get inside the space house. He astronauts will fly in this capsule right now, we've configured it to fly up to five, but the CSU 100 is designed for up to seven. We have a significant experience. Obviously in capitals from Mercury and Gemini Apollo capsule was, was an easy decision. What about Comfort? This isn't exactly the most comfortable position I've ever been in. No, absolutely. But because of the potential with different anomalies, you could have a very rough Landing, we needed to make sure that this design would satisfy even the roughest potential Landing. Chris Ferguson piloted, America's last shuttle, and his new mission is to get boeings commercial space program off the ground. This is the simulator for the CST 100. Yes, this is going to be what we call our engineering simulator, how similar is commanding A sit here and you look at this coffee and say wow looks like I'm in a fighter airplane, bowling has been building fighter airplanes for decades. So we were able to take a lot of the expertise and actually involve a lot of the people who designed these companies and make them apart of this right here. Do you think that that lineage in history gives Boeing a leg up over their competitors? I would like to think so. Of course, Boeing was the prime contractor to build a special"}