{"Dataset":"magellan","KeyName":"Inbound Sample 1","Service":"AudireAI","Duration":567,"Transcript":"You have reached the essence of Oregon. This is Donna. I'll be assisting you with your inquiries today. Please be informed that this call is being recorded and monitored for quality assurance purposes. How may I help you? Well, I bought or I I got this essence of Argon oil for shipping handling and handling cost of 599, a sample of it. And if I want to cancel the order, I had to do it within 15 days. And so that is what I want wanted to do. I didn't want to I didn't want to get, you know, like a monthly for what is it, 83 a month. I can't afford that. Okay. I'm more than happy I mean I'm happy to assist you. For me to be able to pull up your subscription here, could you kind of provide me your first and your last name? Carolyn, CAR,O,L,Y,N. A R O L Y N, Lake, LAKE O-L-Y-N. k e. O L, Y, N. And then LAKE. Yes, L A K E. Yes. Yes. Okay, just go ahead to pull up your subscription here or your account. Okay. And could you kind of verify your email address, please? It's lake3921hotmail.com. How about your shipping address? 310 Warren Avenue, number 2, Gillette, Wyoming 82716. And is your shipping address the same as your billing address? Correct. How about your phone number? 307-680-2068. Okay. thank you very much for that information, Miss Lake. If you don't mind me asking, may I know the reason why you want to cancel the subscription? Well, I just I thought I was just getting a a, a sample order of it. You know, I was curious Have you how it worked and everything. Yes. I mean, have you already used it? Not all of it, but. Not all of it. but I have. Okay. I have been using it. Yes. Okay. I do understand that, Ms. Blake. This is what I can do for you, for you to be able, you know, to maximize or enjoy the benefits of the organ. I'm going to extend your pretrial for another 15 days with no charge. So at least you do have 15 days to enjoy, you know, the amazing product and then give us a call back before the end of that 15day additional or extension period to give us the feedback. Because what I heard from you is that you haven't used the product that much. So you're not, you know, here did not yet get what the benefits of it. So that's the reason why I'm extending your period or your pretrial for you to be able to enjoy and discover the benefits of Essence of organ, Okay? Okay. What date would that be? Okay. let me check here. So you're already extended your pretrial. It will end on August 24th. So you need to give us a call back before August 24th to give us a feedback. if you, I mean, what happened to the product if it didn't something, you know, it gives you the benefits that you need. But let's say you love the product, you like the product, you don't need to give us a call callback back then. Okay. It will be automatically you will be receiving another bottle for your monthly subscription And in onset of a call, I heard that you're not, you know, you're you're dealing about the The price, which is 83.80. cents, right? Okay. so what I can do for you is aside from extending your pretrial for for another 15 days, I'm also giving you my employee discount, which is 20% discount. So instead of paying 83.80, you're going to pay only 67.04. How about that? I I can't. I can't afford that. Okay. This is my This is my maximum employee discount, a 40% employee discount. I'll give it to you. It's actually a lifetime employee discount. So instead of paying 83.80 or just be paying 50.28. No, I can't. I can't. I cannot do that. I can't. I'd like to. And I wanted to ask you too is... Go ahead. How often am I supposed to use that? Like at night or. Yes. as long as you want, ma'am. Just use it at night? Yes, as long as you want, as long as you need long as you need it. Oh, okay. Okay, Ms. Lake. Can I just put you Yeah, I can't afford. Can I just put you on hold for a minute? Sure. Thank you. Thank you very much for your patiently waiting, Ms. Lake. Okay. I already talked to my supervisor and she asked me what amount would you feel the product would will be more affordable for you and make you continue your subscription with us? Oh. If we will ask you, do you think I could, you know, like 15? I know that's, you know, but that Okay, know. But that. Okay, ma'am, don't worry. That's great. because I already giving you my employee discount of 40%, right? So my supervisor can give you another 40%. So that's an equivalent of 80%. So instead of paying 83.80, what you'll be paying is only 16.76 every month for everybody. How about that? That sounds great. Okay, that's great. So I'm extending your pretrial until August 24th. So after August 24th, you will be charged only 16.76. Okay. So every month you will be paying. I mean, you will be receiving a bottle of essence of Argon, and you will be enjoying the benefits of the product, but you will be only paying 16.76. Okay. Okay. Okay, then. So that's great. So just for a recap, Ms. Lake, I extended your pretrial for another 15 days, and it's going to be end on August 24th, So you can give us a call back within that period of time to give us a feedback. But if like what I've said, if you enjoy the product, it gives you the benefits, the amazing benefits of the product. You don't need to give us a callback. back. It will be automatically. You will be receiving a subscription every month, but you will be only paying 16.76 because we already give you our employee discount of 80% for Lifetime. Okay? Okay. All right. Okay, then. So is there anything else I can help you with? No, that would be it. Okay, then. So we value your business. Thank you for calling Essence of Oregon. Have a great day. You too. Bye. bye."}