{"Dataset":"popuppodcasting","KeyName":"matty","Service":"AWS","Duration":474,"Transcript":"It's been said of you that you're the most relevant chef in the country. Yeah, I don't know about that. That's ridiculous. I'm not, I'm just a guy that has a lot of hits on YouTube and got a TV show and is a chef. Sitting in the kitchen I He's on the beach Gathered everything right in reaching that sitting in the kitchen. That's what I like. Pudgy chef Matty Matheson has been called the John Belushi of the Toronto food scene, and not just because he's witty, brash and talented, but because his addictions nearly killed him. I'm Marian Kane Food sleuth, and welcome to Sit in the kitchen. Matty is executive chef of the trendy parts and labor, but today he's busy with his hugely popular Vice TV show, Dead Set on Life. Plus nearly 200,000 Instagram followers and YouTube videos seen by millions. I met him at his restaurant in the Parkdale neighborhood of Toronto. I'd keep you in. Finally, I meet you, Maddie. It's taken 6 months to get this interview. Well now we're here, so we're good. We're good. Let's let's not complain about it. How are you mood wise? Are you a good positive person? Yeah, I I think I'm a pretty happy guy. You know, it takes a lot of work to be an asshole, you know, I got a wonderful family. I got a wonderful job. You're in the early 30s now, and it hasn't always been that way, you know, I guess what, 4 years ago I was at the end of my rope, I guess, and I guess I was just like a typical party chef, you know, every cliche in the book thinking that drinking and doing drugs and partying hard and working really hard hours was a sustainable way of living, and it wasn't, you know, and I had to, uh, cool my jets a bit and stopped doing all that shit about 3 years ago. You had a heart attack in 2012. Was that a serious heart attack? I think most heart attacks are pretty serious. Was it a wake-up call for you? It was, but it certainly wasn't the end of what I was doing. I had my heart attack and then I partied for two more years because I Grew this like Superman ego cause I'm like, I didn't die. So then I was just like, I'm invincible, I'm gonna do more drugs. And, and I had to do things more secretly cause a lot of my friends were scared or cared about what I was doing, so I had to like kind of turn into more of a sneaky dude and like, uh, that's when I turned into like a real kind of, um, addict, you know, I, I had to like really find things and dig around and go to like kind of deeper, darker kind of places to get drugs and But you know, I, I'm lucky I got to come out the other side and it's cool. What do you think in hindsight drove you to those addictions? Um, I don't know. I don't have too many demons, you know, I was definitely more of a A happy go lucky party animal. Like, um, I just really like doing drugs. There is excitement of going to seedy places and really getting into the underbelly of shit. Like there's always that weird romantic thing about it for some reason, and I was about it. Like I, I really like that, uh, kind of grimy underbelly of Toronto and trying to get drugs at, you know, 6 a.m. is a bit of a chore, so you get to meet some savory characters. It was partly a sense of adventure and danger and living on the dark side. I didn't want the party to stop, you know, it was that kind of a scenario, just kept going and going and going and you just don't want it to stop and finally you're like the last guy at the party, you know, and that kind of like clicks and you're like, oh yeah. Nobody else is here or, like, you know, like it really turns into like a sad story very quickly. Do you now not drink or do drugs? Abstinence? Complete abstinence for like 3.5 years. Yeah, not a drip, not a nothing. I haven't had a relapse yet, you know, and it's, uh, it's pretty awesome. Well, you're very successful. That must come with a thrill. Fame and fortune. Well, the first thing I've learned is fame isn't fortune. You know, I thought I'd get a TV show and then all of a sudden I'd have like, you know, I still can't afford a fucking house in Toronto. So do you rent a flat? We rent a house in Parkdale, which is sweet. You have a wife and child. I got a wife and child, yeah, Trish and Mac, and they're great, really amazing people. You grew up in a small town, Fort Erie, near Buffalo. How was that? It was awesome. We just rode our bikes around like we had tree forts and go to the beaches. Like it was really awesome. And then when I got a little older, like, it was amazing because I could go to Buffalo, and that's where I found like the punk and hardcore scene. It was really cool, you know. I saw that episode of your show, Dead Set on Life. When you go back to your hometown and you revisit the favorite food of your childhood, chicken nuggets on a sub. You know, growing up, going to Robomart, it's just like a gas station with like a, like a bodega in it where you can get sandwiches or chicken wings or whatever. It's just like kind of humble beginnings, you know, my favorite restaurant is a gas station in Fort Erie. Your parents appear in that episode, they seem like nice people. Who? My parents? My parents are amazing, very creative, very supportive, very, uh, You know, adventurous, really cool parents, like really gave me um the notion that I could do whatever I wanted to do. They're sweethearts, you know, I love them. You're very funny on that show. I was prepared to hate it because I'm older than you considerably, and I thought, oh, it's just gonna be antics. He's a tattooed guy, used foul language. You haven't used one swear word yet today. Everyone, like, I'll be out in public, and then this is all weird cause it's all very new. I went into this like shoe store and some guy's like, Yo, I can't believe that like you're in here like. You're not like how you are on TV. And I'm like, what am I supposed, I'm supposed to like yell at people or like, I think people misconstrue like they see a big tattoo guy and they don't see the smaller moments where I'm like just kind of chill and human and like, I'm not running around in public yelling and swearing all the time and like I am that person in some respects, but like, it is television and I'm entertaining. You know, and it's just like, there's a lot of moments in the day where I'm not entertaining and I'm just chill. I'm just relaxed and everything's cool. I made your mac and cheese last night with Cheetos on top. It was delicious. I was, I was totally shocked, honestly, because it was so easy. Yeah, no, those recipes are made to be easy."}