{"Dataset":"magellan","KeyName":"Customer Service Sample","Service":"Speechmatics","Duration":358,"Transcript":"Thank you for calling coats and gowns. My name is Sam. How can I help you? Oh, yes. Um, I borrowed a coat from from you guys, but I need to return it because it was the wrong size. And my size is not available. I haven't received any email from you, and I wonder if my payment has been refunded. Seems like it does not affect on my account yet. I do apologize for the inconvenience, but let me go ahead and check if there are some notes in the order details. It has me ask for the original online order number. Okay, uh, let me see. All right. Please, uh, wait for a moment. Okay. Hold on. Okay. I believe it's, uh, 0171425793. Thank you. Just to verify that 1425793. Correct? Yes. That's right. I do apologize, but the one that you provided is actually not accepting towards our database. Do you actually have a number that starts with 000, 7 or 7 or um, you can ask for your first and last name so you can manually check it in our database. Yeah. I'm not sure about the 000 something. Anyway, it's Adam Wilson. All right. Thank you. So Wilson is spelled as W for whiskey, I for India L for Lima as for Sierra. Oh for Oscar and for November. Is that correct? Adam. Yes. All right. Thank you for that information. Okay. Let me just quickly look into a portal and check any notes in your order. Do you still have the return tracking from the courier company when you return the item? Um. Not sure. Um, is it the 74391? Uh, that's, uh, actually the return authorization from coats and gowns. When you return the item to the query your company for shipping, they should have provided you with the return tracking. Do you still have that? It's actually printed in the upper right part of the receipt. Okay. I probably have to dig it up. Okay, I imagine I have it somewhere, but, uh, it might take some time to look for that. Oh, I see, anyway, I tried to search for your name and nothing is coming up. Can I ask for, uh, the order under your name originally? Uh, yeah. Yeah, it's under my name. So it's not under Andy or something. It's Adam. Yeah, exactly. Thank you. Now, what's the phone number that you put in the order before? Okay. Uh, probably it's the 411 450377. Thank you. Just to make sure this (411) 345-0377. Is that correct? O0377. Okay. And what's the email address that you gave when you fill out the order form. Okay. That should be Adam underscore Wilson at mail fans.com. Thank you. So again it's Adam underscore Wilson at mail fence.com. Is that correct. Yes it is. Thank you. So, Adam um. Adam underscore Wilson and mail fans.com okay. Thank you. Now I just want to make sure that I have the correct details. Please hold on for a moment. We'll check on the details here in mind. Okay. Oh, sure. No problem. All right. Okay. Thank you for patiently waiting, Adam. Now, I actually or I can actually see here that you have called to inform us that you'd like to return the item on the 15th of November. Is that correct? Yes. How did you return the item to declare your company on the same day that you called? Probably close to it. I'm not really sure if it's on the same day though, but probably just close to that day. I understand, however, I've been checking the date that you actually called in for the return. It's already beyond the timeframe that we ask for refunds. So what we'll do is I'll go ahead and forward this information to our corporate office, and I'll have them check and update you directly about the refund. So please expect an email within 2 to 4 business days. Is that okay with you 2 to 4 business days? Yes. Um. No worries. I will send it to to them right now. Oh, really? Okay. All right, all right. At first I thought that it would probably be like 3 to 5 eggs to process. Oh no no no no. Don't worry, Adam, it's only 2 to 4 business days. So you already checked your account and nothing has been credited yet in the card ending in seven, five, three. Is that right? Nothing yet. Okay, I understand, and I'll go ahead and forward them to, uh, forward in the details that I have here. So I'll send the email to Adam underscore Wilson at meal fans.com. Correct. Yes. That's right. All right. Thank you so much for that information, Adam. I will be forwarding this over to our corporate office now. And, uh, thank you again for calling coats and gowns. Is there anything else I can help you with today? Oh, no. That's all. Thank you. You're welcome. And, uh. My pleasure. Have a nice day. Bye. All right. Thank you."}