{"Dataset":"magellan","KeyName":"Inbound Sample 1","Service":"Speechmatics","Duration":567,"Transcript":"You have reached the essence of Hagen. This is Donna. I'll be assisting you with your inquiries today. Please be informed that this call is being recorded and monitored for quality assurance purposes. How may I help you? Um, well, I bought I got this, um, essence of argan oil, um, for shipping, handling and handling cost to find 99 sample of it. And, um, if I want to cancel the order, I had to do it within 15 days. And so that is, um, what I want wanted to do. I didn't want to I didn't want to get, you know, like a monthly for what is it, $83 a month? Um, okay. I can't afford that. Okay. I'm more than happy. I mean, I'm happy to assist you, um, for me to be able to pull up your, um, subscription here, could you provide me your first and your last name? I'm Carolyn, Carolyn Lake and Lake Ellyn. And then. Yes. Lake? Yes. Okay, let's just, um, go ahead to pull up your subscription here or your account. Okay. And could you verify your email address, please? It's Lake 3921 at hotmail.com. How about your shipping address? Uh, 310 Warren Avenue. Number two, Gillette, Wyoming, 82716. And is your shipping address same as your billing address? Correct. How about your phone number? Um, (307) 680-2068. Okay. Thank you very much for that information, Miss Lake. If you don't want me asking me the reason why you want to cancel the subscription. Well, I just I thought I was just getting a sample order of it. You know, I was curious. Um, have you read how it worked and everything? Yes. I mean, have you already, uh, used. Not all of it, but not all of it, but I have. Okay. I have been using it. Yes. Okay. I do understand that, uh, Miss Lake, uh, this is what I can do for you. For you to be able, you know, to, uh, maximize or enjoy the benefits of the Oregon are going to extend your pretrial for another 15 days with no charge. So at least you do have 15 days to enjoy, uh, you know, the amazing product. And then give us a call back before the end of that 15 day additional or extension period to give us the feedback. Because what I heard from you is that you haven't used the product that much, so you're not, you know, here did not yet get what the benefits of it. So that's the reason why I'm extending your, um, uh, period or your pre-trial for you to be able to enjoy and discover the benefits of Essence of Oregon. Okay? Okay. Um, what would that be? Okay, let me check here. So your, um, uh, already extended your pre-trial. It will end on August 24th, so you need to give us a call back before August 24th to give us a feedback. Uh, if you, uh, I mean, what happened to the product if it didn't, something, you know, uh, it gives you the benefits that you need. But let's say you love the product. You like the product. You don't need to give us a call back. Then it will be automatically. You will be receiving another bottle for your monthly subscription. And in one set of a call, I heard that you're not, you know, um, you're, uh, you're dealing about the the price, which is $83.80. Right. Okay. So what I can do for you is, aside from extending your pre-trial for another 15 days, I'm also giving you my employee discount, which is 20% discount. So instead of paying $83.80, you're going to pay only $67.04. How about that? I can't I can't afford that. Okay. Uh, this is not. Uh-Uh, uh, this is my maximum employee discount. A 40% employee discount. I'll give it to you. It's actually a lifetime employee discount. So instead of paying $83.80 or just be paying $50.28? No, I can't, I can't I cannot do that. I can't I'd like to and I wanted to ask you to is go ahead. Um, how often am I supposed to use that? Like at night or. Yes, as long as you want, ma'am. Yes. Use it at night. Yes, as long as you want. As long as you need it. Oh, okay. Okay. Um, it's like, can I just put yours? Yeah, I can't afford. Oh, can I just put you on hold for a minute? Okay? Sure. Thank you. Thank you very much for patiently waiting, Miss Lake. Okay, I. Just talked to my supervisor, and, um, she asked me what amount would you feel the product will be more affordable for you and make your continue your subscription with us? Oh, um, well. We will ask you, do you think. Mhm. I, you know, like $15. Oh I know that you know, but that's okay ma'am. Don't worry. That's great. Uh, because I already given you my employee discount of 40%. Right. So my supervisor can give you another 40%. So that's an equivalent of 80%. So instead of paying $83.80, what you'll be paying is only $16.76 every month for every bottle. How about that? That sounds great. Okay. That's great. So I'm extending your pre-trial until August 24th. So after August 24th, you will be charged only $16.76. Okay. So every month you will be paying. I mean, you will be receiving a bottle of Essence of Argon and you will be enjoying the benefits of the product, but you will be only paying $16.76. Okay. Okay. Okay then. So that's great. So, um, uh, just for a recap, Miss Lake, I extended your pre-trial for another 15 days, and it's going to be end on August 24th, so you can give us a call back, uh, by within that period of time to give us a feedback. But if, like what I've said, if you enjoy the product, it gives you the benefits, the amazing benefits of the product. You don't need to give us a call back. It will be automatically. You will be receiving a subscription every month, but you will be only paying, uh, $16.76 because you already give you our employee discount of 80% for lifetime. Okay. Okay. All right. Okay. So, um, is there anything else we can help you with? Um, no, that would be it. Okay, so we value your business. Thank you for calling Essence of Oregon. Have a great day. You, too. Bye bye."}