{"Dataset":"magellan","KeyName":"Inbound Sample 2","Service":"Speechmatics","Duration":229,"Transcript":"You're listening to Magellan Solutions podcast. For more information about Magellan Solutions, log on to WW at Jones solutions.com. And now here's an inbound call recording. Thanks for calling AT&T. When he was Erica, could I have the cell phone number that they're calling about today? (406) 539-1202. That number was (406) 539-1202. Is that correct? Yes. So how can we help you today? Well, I got this letter saying I can get the BlackBerry torch. Mhm. Okay. The warranty more than happy to Stevie that. But before we proceed for security reasons of your account, can you please verify some information for me first. Yep. Can I have the first and last name of the account holder. Josh Mulligan? Okay. And who am I speaking with today, if I may ask? Jeff. Okay. Mr. Milligan, can you please verify the billing zip code? 59714. And also the last four digits of your Social Security. Number Far, far away. Thanks so much for that information. So just to make it clear that I understand you correctly, you received a letter regarding the BlackBerry torch and you want to take advantage of this offer? Yes. Okay. Be more than happy to assist you with that. I'll be filling out all the information needed for the exchange, and this will be processed within 24 hours from now. And I just want to let you know that the new device will arrive within 3 to 5 business days. Please do not return old phone until you receive the new device. And I just want to let you know that if the original phone's not returned within 30 days, you will be subject to $150 charge bill to your account. Also, please don't forget to take the SIM card out of the original phone and place it in the new phone. Okay? And also, you will be receiving a customer service on rated Alpine's or AT&T service by AT&T features by email or U.S. mail. This summary will include an activation fee. However, this does not apply to you and you will not be charged. We do apologize for any confusion this may cost, and if you have any further questions regarding this, please feel free to ask 611 from AT&T handset. Okay, and I'll be sending a return label as well for you to return the whole device. I'm just going to verify where they want me to send the return label. Do you want me to send it via email or to your shipping address? Shipping? Okay. I'm just going to verify that it would be to 98 miles and drive. Velvet. Montana. 59714. Is that correct? Yes. Okay. And is this the same address for? I'm going to ship the BlackBerry torch? Yes. Okay. And also, once you receive the block, I mean, the return label just simply affixed it to the phone box and drop it in any USB blue box. Okay. Drop it in white in any USBs. Blue box. Okay. Okay, so I'm done feeling that all the information needed here for the exchange. So do you have any questions regarding the information that I provide you, Mr. Milligan? No. Is there anything else I can help you with? I don't think so. Okay. We do value and appreciate your business. Thank you for calling AT&T. Have a great day. Thank you. Okay. Goodbye. But thank you for listening to our podcast. Find out more about our services by visiting Magellan Solutions. Com or call our toll free numbers from the US, UK and Australia."}